# ***********************************************************************************************
# Title     : {CausalImpact}を使う上での注意点を簡単にまとめてみた（2019/9/10）
# Objective : TODO
# Created by: Owner
# Created on: 2021/02/05
# URL       : https://tjo.hatenablog.com/entry/2019/09/10/080000
# ***********************************************************************************************


# ＜概要＞
# - 時系列クラスタリングを膨大な行数のデータに対して実行する際にどれほど厳密にやるべきか？
#   --- 動的時間伸縮法(DTW)で距離行列を算出してhclust関数でクラスタリングするのが王道
#   --- いずれも大規模データでは動作が遅い
#   --- k-means(動作が速い)でも似た結果が出るか確認


# ＜目次＞
# 0 準備
# 1 基本的なアイデア
# 2 CausalImpactのチュートリアル
# 3 共変量がなかった場合


# 0 準備 ---------------------------------------------------------------------------------

# ライブラリ
library(tidyverse)
library(CausalImpact)

# 乱数シード
set.seed(1)


# 1 基本的なアイデア ----------------------------------------------------------------------

# ■手順1
# キャンペーンの影響を受けていると思われる目的変数の時系列データ(y)に対して以下の2つを用意
# 1) 影響を受けていない他の共変量となり得る時系列(x1)
# 2) キャンペーン期間を表すベクトル

# ■手順2
# キャンペーンの影響を受けなかったと仮定した場合の目的変数の予測値を状態空間＋MCMCで算出

# ■手順3
# 実測値と比較することでキャンペーンの因果的影響の大きさを見る


# ＜参考＞
# - {CausalImpact}はこのcounterfactual modelingのバックエンドに{bsts}で推定した状態空間モデルを用いる
# --- 状態空間モデルには色々な利点がありますが、一番大きいのは欠損値に強い点
# --- 実際{bsts}は学習データに多少の欠損値があってもかなり正確な推定結果を返す

# - counterfactual modeling
# --- 検証したい目的変数の時系列に加えて適切な共変量を用意
# --- その共変量を用いて目的変数によって{bsts}でモデリング
# --- 介入しなかった場合の目的変数の時系列と実測値の時系列とを比べた乖離で介入効果の有無や大小を評価
# --- 共変量は介入による影響を受けないことを想定する（結構強い仮定、差分の差分法(DiD)を要求している）


# 2 CausalImpactのチュートリアル --------------------------------------------------------------

# 時系列データの作成
# --- 共変量（説明変数）
x1 <- 100 + arima.sim(model = list(ar = 0.999), n = 100)

# 目的変数
# --- 共変量(x1)に基づいてデータ生成
# --- キャンペーン効果を追加（急上昇）
y <- 1.2 * x1 + rnorm(100)
y[71:100] <- y[71:100] + 10

# データ結合
# --- x1: 共変量（キャンペーンの影響を受けていない）
# --- y : 目的変数（キャンペーンの影響を反映している）
data <- cbind(y, x1)
data %>% plot.ts()

# キャンペーン期間
# --- キャンペーン前
# --- キャンペーン後
pre.period <- c(1, 70)
post.period <- c(71, 100)

# 計算実行
impact <- data %>% CausalImpact(pre.period, post.period)

# サマリー
impact %>% summary()

# プロット
impact %>% plot()


# 3 共変量がなかった場合 ----------------------------------------------------------------------

# ＜ポイント＞
# - 共変量がある場合は介入効果のposterior intervalは狭くなり、ない場合はかなり広くなる
#   --- 共変量がある場合は当然{bsts}は共変量を外生変数とする回帰モデルを計算
#   --- 共変量がない場合はただの自己回帰モデルを計算
#   --- ｢良い共変量を探す｣ことが重要！


# 時系列データの作成
# --- 共変量（説明変数）
x1 <- 100 + arima.sim(model = list(ar = 0.999), n = 52)

# 目的変数
# --- 元データを生成
# --- キャンペーン効果を追加
y <- 1.2 * x1 + rnorm(52)
y[41:52] <- y[41:52] + 10

# データ結合
data <- cbind(y, x1)

# キャンペーン期間
# --- キャンペーン前
# --- キャンペーン後
pre.period <- c(1, 40)
post.period <- c(41, 52)

# 計算実行
# --- 共変量がある場合
# --- 共変量がない場合（1変量の場合はzooオブジェクト）
impact1 <- data %>% CausalImpact(pre.period, post.period)
impact2 <- y %>% as.zoo() %>% CausalImpact(pre.period, post.period)

# プロット作成
# --- 共変量がある場合
# --- 共変量がない場合
impact1 %>% plot()
impact2 %>% plot()
